### 🔧 Bootstrap Terraform Plan

<details>
<summary>点击展开 Plan 输出</summary>

```hcl
null_resource.k3s_server: Refreshing state... [id=127050603283306056]
local_sensitive_file.ssh_key: Refreshing state... [id=f6bef8bf75abefb62ee12a1e5d4dc5fffd3bede3]
kubernetes_namespace.bootstrap: Refreshing state... [id=bootstrap]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.platform: Refreshing state... [id=platform]
cloudflare_record.root: Refreshing state... [id=6af3d1fa49c3d911892f195a4c7fd6c4]
helm_release.cnpg_operator: Refreshing state... [id=cnpg]
cloudflare_record.wildcard_public: Refreshing state... [id=ad4c7065dfdc814f8fceb49ebe907ae4]
cloudflare_record.x_staging: Refreshing state... [id=994d200bafbce9b2e8c0c3d1b4536678]
cloudflare_record.infra_records["secrets"]: Refreshing state... [id=fd7459cadcd7cc6b278b3cf48a0b1398]
cloudflare_record.infra_records["kdashboard"]: Refreshing state... [id=8ed6a6305893dd0bdead535fd5d45016]
cloudflare_record.infra_records["kapi"]: Refreshing state... [id=281f5c2bf647990805ca894fc0631038]
cloudflare_record.infra_records["sso"]: Refreshing state... [id=70ad91913df52a16ec8902afdb9bb6e1]
cloudflare_record.infra_records["digger"]: Refreshing state... [id=9fc7192d978f4a4a56c099b4498369e4]
cloudflare_record.infra_records["kcloud"]: Refreshing state... [id=6f06ad93f69bd78245fdfe8a57ddd189]
cloudflare_record.infra_records["signoz"]: Refreshing state... [id=5b90434833452b7d428d61c7d33c1263]
cloudflare_record.infra_records["auth"]: Refreshing state... [id=76f911197685888fb53b7491a4ad5b1c]
cloudflare_record.infra_records["k3s"]: Refreshing state... [id=34540150c83277063b0e8752aabbe4d3]
cloudflare_record.infra_records["openpanel"]: Refreshing state... [id=96fe6a95fd7414d551adc36bdd9c3176]
cloudflare_record.infra_records["home"]: Refreshing state... [id=b3a26757041f1edd4d855554356d2084]
cloudflare_record.wildcard_internal[0]: Refreshing state... [id=d2abf7cd2683a09c2158d35e009219f7]
null_resource.kubeconfig: Refreshing state... [id=7352832925648048633]
kubernetes_secret.platform_pg_superuser: Refreshing state... [id=platform/platform-pg-superuser]
kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
helm_release.cert_manager: Refreshing state... [id=cert-manager]
data.local_file.kubeconfig: Reading...
data.local_file.kubeconfig: Read complete after 0s [id=e8e9d6301d5e9261409aef623945966463087ba8]
kubectl_manifest.traefik_config: Refreshing state... [id=/apis/helm.cattle.io/v1/namespaces/kube-system/helmchartconfigs/traefik]
kubernetes_storage_class.local_path_retain: Refreshing state... [id=local-path-retain]
kubernetes_config_map_v1.local_path_config: Refreshing state... [id=kube-system/local-path-config]
kubectl_manifest.local_path_provisioner_restart: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/deployments/local-path-provisioner]
kubectl_manifest.platform_pg: Refreshing state... [id=/apis/postgresql.cnpg.io/v1/namespaces/platform/clusters/platform-pg]
time_sleep.wait_for_platform_pg: Refreshing state... [id=2025-12-24T20:13:55Z]
helm_release.digger: Refreshing state... [id=digger]
kubectl_manifest.cluster_issuer_letsencrypt_prod: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod]
kubectl_manifest.wildcard_certificate_public: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-public]
kubectl_manifest.wildcard_certificate_internal: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-internal]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.ssh_key will be created
  + resource "local_sensitive_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "/tmp/infra-k3s.id_rsa"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>
